Revit 2024 API
NonContinuousRailInfo Members
The NonContinuousRailInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the NonContinuousRailInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidNonContinuousRailHeight
 Checks whether the input height is valid for a non-continuous rail in its associated railing type.
IsValidNonContinuousRailMaterial
 Checks whether an ElementId is a valid material Id of a non-continuous rail.
IsValidNonContinuousRailName
 Checks whether the input name is valid for a non-continuous rail in its associated railing type.
IsValidNonContinuousRailProfile
 Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Height
 The height at which the non-continuous rail will be placed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 The material id associated with the non-continuous rail, or invalidElementId if none.
Name
 The name of the non-continuous rail.
Offset
 The side offset of the non-continuous rail from a [!:Autodesk::Revit::DB::Architecture::Railing] from the railing center.
ProfileId
 The profile id of the non-continuous rail, or invalidElementId if none.
See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace